// 1. Составьте программу, которая присваивает переменной d значение 7, а затем выводит на экран: в первой строке - это значение, во второй – квадрат этого значения, в третьей – куб этого значения. Программа должна выводить на экран новое значение.
// const d = 7;
// console.log(d);
// console.log(Math.pow(d,2));
// console.log(Math.pow(d,3));


//2.Составьте программу, которая принимает с клавиатуры два целых числа и, если первое больше второго, выводит на экран их сумму, если же наоборот – выводит на экран их произведение. В случае же, если числа одинаковы, программа выводит на экран сообщение "числа одинаковые".
// let num = Number(prompt('enter the number'));
// let num2 = Number(prompt('enter the number'));
// let sum = num + num2;

// if(num > num2){
//     console.log(sum);
// }else if( num < num2){
//     console.log(num * num2); 
// }else if( num = num2) {
//     console.log("числа одинаковые"); 
// }


//3. Составьте программу, которая принимает с клавиатуры целое число и, если оно положительное, выводит его куб.

// let num3 = Number(prompt('enter the number'));
// if(num3 > 0){
//          console.log(Math.pow(num3,3));
//      }



//4.Составьте программу, которая принимает с клавиатуры два числа: первое – количество учеников в классе, второе – количество стульев в кабинете.  Программа проверит соответствие между этими двумя значениями и выведет на экран соответствующую информацию. ввод: 24, 28 ⇒ вывод: стульев хватает; ввод: 24, 22 ⇒ вывод: стульев не хватает
// let quantityStudent = Number(prompt('Введите количество учеников в классе'));
// let quantityChairs = Number(prompt('Введите количество стульев в классе'));
// if(quantityStudent <= quantityChairs){
//            console.log("стульев хватает");
//         }

//         if(quantityStudent > quantityChairs){
//             console.log("стульев не хватает");
//          }

// 5.Составьте программу, которая выводит на экран все однозначные положительные числа в возрастающем порядке. 

// let arr =[25, -3, 4, 10, 1, -5, 3, 8, 96, 11, 9];
// for(let i = 0; i < arr.length; i++){
//     if(arr[i] > 0 && arr[i] < 10) 
//     {
//             console.log(arr[i] );
//        }   
// }

// for(let i=0; i<10; i++){
//     if(i>0 && i<10){
//        console.log(i); 
//     }
// }

// 6. Написать цикл, который выводит те числа из массива, которые больше или равны 15.

// let arr =[25, -3, 4, 10, 15, -5, 3, 8, 96, 28, 9];

// for(let i = 0; i < arr.length; i++){
//          if(arr[i] >= 15) 
//          {
//                 console.log(arr[i] );
//            }   
//      }

// 7. Написать цикл, который выводит только нечетные числа массива 

// let arr =[25, 4, 10, 15, 3, 96, 28, 9, 8, -7];

// for(let i = 1; i < arr.length; i++){
//             if(arr[i] % 2 !== 0) 
//              {
//                     console.log(arr[i]);
//                }   
//          }

// 8. Вывести только те значения массива, индекс которых кратен трем.

// let arr =[25, 4, 10, 15, 3, 96, 28, 9, 8, -7, 12];

// for(let i = 1; i < arr.length; i++){
//             if(arr[i] % 3 == 0) 
//              {
//                     console.log(arr[i]);
//                }   
//          }

// 9. Найти сумму нечетных чисел и вывести в консоль. 


// let arr =[25, 4, 10, 15, 3, 96, 28, 9, 8, -7];
// let sum = 0;

// for(let i = 0; i < arr.length; i++){
//             if(arr[i] % 2 !== 0) 
//              {
//                 sum += arr[i];   
//                }   
//          }
// console.log(sum);

// 10. Найти сумму четных и нечетных чисел из массива и вывести разницу между ними. Вычесть из большего меньшее.

// let arr =[25, 4, 10, 15, 3, 96, 28, 9, 8, -7];
// let sum1 = 0;
// let sum2 = 0


// for(let i = 0; i < arr.length; i++){
//             if(arr[i] % 2 !== 0) 
//              {
//                 sum1 += arr[i];  
//                }    
//                if(arr[i] % 2 == 0) 
//              {
//                 sum2 += arr[i];  
//                }  
//          }
// console.log(sum1); 
// console.log(sum2);

//  if(sum1 < sum2) {
// console.log(sum2 - sum1);} 





      

         

